ConfigurationFonecmidDiplomTuzeka/src/DataProcessors/ВКМ_КалендарьСпециалистов/ВКМ_КалендарьСпециалистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_КалендарьСпециалистов</name>
</mdclass:DataProcessor>

ConfigurationFonecmidDiplomTuzeka/src/Enums/ВКМ_КатегорииСотрудников/ВКМ_КатегорииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорииСотрудников</name>
  <enumValues>
    <name>ВКМ_Специалист</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

ConfigurationFonecmidDiplomTuzeka/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ВыполненныеРаботы</name>
    <attributes>
      <name>ВКМ_ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧасыКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ConfigurationFonecmidDiplomTuzeka/src/DataProcessors/ВКМ_КалендарьСпециалистов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ВКМ_ЗаполнитьПланировщик();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ВКМ_ОбслуживаниеКлиентаИзменено" Тогда
		ВКМ_ЗаполнитьПланировщикНаСервере();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВКМ_ПланировщикПроверкаПеретаскиванияВнутри(
	Элемент,
	ПараметрыПеретаскивания,
	ВариантИзмененияГраниц,
	ДействиеПеретаскивания,
	Отказ)

	Если ДействиеПеретаскивания <> ДействиеПеретаскиванияВнутриПланировщика.Создание Тогда
		Возврат;
	КонецЕсли;

	Отказ = Истина;

	ПараметрСоздания = ПараметрыПеретаскивания[0];
	Специалист = ПараметрСоздания.ЗначенияИзмерений.Получить("ВКМ_Специалист");

	Если Специалист = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ВКМ_Специалист", Специалист);
	ЗначенияЗаполнения.Вставить("ВКМ_ДатаПроведенияРабот", НачалоДня(ПараметрСоздания.Начало));
	ЗначенияЗаполнения.Вставить("ВКМ_ВремяНачалаРабот", ПараметрСоздания.Начало);
	ЗначенияЗаполнения.Вставить("ВКМ_ВремяОкончанияРабот", ПараметрСоздания.Конец);

	ОткрытьФорму(
		"Документ.ВКМ_ОбслуживаниеКлиента.ФормаОбъекта",
		Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения),
		ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ЗаполнитьПланировщикНаСервере()

	ВКМ_ЗаполнитьПланировщик();

КонецПроцедуры

&НаСервере
Процедура ВКМ_ЗаполнитьПланировщик()

	ВКМ_Планировщик.Измерения.Очистить();
	ВКМ_Планировщик.Элементы.Очистить();

	НачалоПериода = НачалоНедели(ТекущаяДатаСеанса());
	КонецПериода = КонецНедели(ТекущаяДатаСеанса());

	ВКМ_Планировщик.ТекущиеПериодыОтображения.Очистить();
	ВКМ_Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецДня(КонецПериода));

	ИзмерениеСпециалист = ВКМ_Планировщик.Измерения.Добавить("ВКМ_Специалист");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВКМ_Сотрудники КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления
	|	И Сотрудники.ВКМ_Категория = ЗНАЧЕНИЕ(Перечисление.ВКМ_КатегорииСотрудников.ВКМ_Специалист)
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	ВыборкаСпециалистов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСпециалистов.Следующий() Цикл
		ЭлементИзмерения = ИзмерениеСпециалист.Элементы.Добавить(ВыборкаСпециалистов.Сотрудник);
		ЭлементИзмерения.Текст = ВыборкаСпециалистов.Наименование;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Обслуживание.Ссылка КАК Ссылка,
	|	Обслуживание.ВКМ_Специалист КАК Специалист,
	|	Обслуживание.ВКМ_Клиент КАК Клиент,
	|	Обслуживание.ВКМ_ДатаПроведенияРабот КАК ДатаПроведенияРабот,
	|	Обслуживание.ВКМ_ВремяНачалаРабот КАК ВремяНачалаРабот,
	|	Обслуживание.ВКМ_ВремяОкончанияРабот КАК ВремяОкончанияРабот
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК Обслуживание
	|ГДЕ
	|	Обслуживание.ВКМ_ДатаПроведенияРабот МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Обслуживание.ВКМ_Специалист <> ЗНАЧЕНИЕ(Справочник.ВКМ_Сотрудники.ПустаяСсылка)";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);

	ВыборкаОбслуживания = Запрос.Выполнить().Выбрать();

	СекундВЧасе = 3600;
	СекундВМинуте = 60;

	Пока ВыборкаОбслуживания.Следующий() Цикл

		НачалоРабот = ВыборкаОбслуживания.ДатаПроведенияРабот
			+ Час(ВыборкаОбслуживания.ВремяНачалаРабот) * СекундВЧасе
			+ Минута(ВыборкаОбслуживания.ВремяНачалаРабот) * СекундВМинуте;
		ОкончаниеРабот = ВыборкаОбслуживания.ДатаПроведенияРабот
			+ Час(ВыборкаОбслуживания.ВремяОкончанияРабот) * СекундВЧасе
			+ Минута(ВыборкаОбслуживания.ВремяОкончанияРабот) * СекундВМинуте;

		Если ОкончаниеРабот <= НачалоРабот Тогда
			Продолжить;
		КонецЕсли;

		Элемент = ВКМ_Планировщик.Элементы.Добавить(НачалоРабот, ОкончаниеРабот);
		Элемент.Значение = ВыборкаОбслуживания.Ссылка;
		Элемент.Текст = Строка(ВыборкаОбслуживания.Клиент);

		ЗначенияИзмерений = Новый Соответствие;
		ЗначенияИзмерений.Вставить("ВКМ_Специалист", ВыборкаОбслуживания.Специалист);
		Элемент.ЗначенияИзмерений = Новый ФиксированноеСоответствие(ЗначенияИзмерений);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
